Revit 2027 API
DirectShape.SetName Method
 Sets the name for the DirectShape element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetName(
	string name
)
Public Sub SetName (
	name As String
)
public:
void SetName(
	String^ name
)
member SetName :
        name : string -> unit
Parameters
name String
 The name.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShape Class
Autodesk.Revit.DB Namespace